
문제 4
  총 예약 건수, 예약 취소건수를 출력하시오 
  매출월, 총매출, 전용상품외매출, 전용상품판매율, 총예약건, 예약완료건, 예약취소건, 예약취소율을 하시오 
-----------------------------------------------------------------------------------------------------------
매출월  총매출   전용외매출   전용매출  전용판매율  총예약건  예약완료건  예약취소건    예약취소율
201706	613000	  469000	      144000	   23.5%	      13	    11	       2	        15.4%
201707	1744000	  1336000	      408000	   23.4%	      41	    35	       6	        14.6%
201708	1622000	  1286000	      336000	   20.7%	      45	    39	       6	        13.3%
201709	1586000	  1322000	      264000	   16.6%	      41	    36         5	        12.2%
201710	3333000	  2781000	      552000	   16.6%	      61	    53	       8	        13.1%
201711	5197000	  4309000	      888000	   17.1%	      94	    82	       12	        12.8%
201712	10862000  7646000	      3216000	   29.6%	      155	    135	       20	        12.9%
----------------------------------------------------------------------------------------------------------


문제 5
월별 온라인_전용 상품 매출액을 일요일부터 월요일까지 구분해 출력하시오 
날짜, 상품명, 일요일, 월요일, 화요일, 수요일, 목요일, 금요일, 토요일의 매출을 구하시오 

----------------------------------------------------------------------------------
월별    상품명       일요일  월요일   화요일  수요일  목요일   금요일  토요일
201706	SPECIAL_SET	48000	0	    0	    48000	48000	0    	0
201707	SPECIAL_SET	0	    0	    48000	96000	0    	0	    264000
201708	SPECIAL_SET	96000	0	    24000	72000	72000	72000	0
201709	SPECIAL_SET	96000	0	    48000	0	    0	    96000	24000
201710	SPECIAL_SET	120000	72000	168000	96000	96000	0    	0
201711	SPECIAL_SET	168000	168000	264000	48000	48000	0	    192000
201712	SPECIAL_SET	432000	48000	672000	600000	576000	72000	816000
----------------------------------------------------------------------------------

문제 6
주소, 우편번호, 해당지역 고객수를 출력하시오
--------------------------------------------------------------
마포구	121100	15
서대문구	120100	12
서초구	137100	12
관악구	151100	10
은평구	122100	10
동작구	156100	8
용산구	140100	8
양천구	158100	8
구로구	152100	8
강서구	157100	7
노원구	139100	7
강북구	142100	7
송파구	138100	6
금천구	153100	6
강남구	135100	6
성동구	133600	6
성북구	136100	6
강동구	134100	6
광진구	143100	6
동대문구	130100	5
중구	100100	4
중랑구	131100	3
도봉구	132100	2
종로구	110100	1
영등포구	150100	1
----------------------------------------------------------


--1
SELECT
        TO_CHAR(TO_DATE(r.reserv_date), 'YYYYMM') AS "매출월",
        SUM(o.sales) AS "총 매출",
        SUM(DECODE(o.item_id, 'M0001', 0, sales)) AS "전용상품외매출",
        SUM(DECODE(o.item_id, 'M0001', sales, 0)) AS "전용상품 매출",
        ROUND(SUM(DECODE(o.item_id, 'M0001', sales, 0)) / SUM(o.sales), 3)*100||'%' AS "전용상품판매율",
        SUM(DECODE(r.cancel, 'Y', 0, 1)),
        SUM(DECODE(r.cancel, 'N', 1,  0))
        
FROM
        item i,
        order_info o,
        reservation r
WHERE
        i.item_id = o.item_id AND
        o.reserv_no = r.reserv_no

GROUP BY TO_CHAR(TO_DATE(r.reserv_date), 'YYYYMM')
ORDER BY TO_CHAR(TO_DATE(r.reserv_date), 'YYYYMM') ASC

;

